/*
Написать функцию, которая возвращает сумму 2-х чисел. Как объявляются функции: 2-а основных способа?
Как вызывать функцию? 
Как передавать аргументы в функцию?
Как передавать количество аргументов, которое не знаешь заранее?
Знать разницу между примитивами и объектами?
Каждую задачу сделать в отдельном файле и загрузить на github!
1-4, 6, 7, 11, 10, 13, 5
Каждую задачу сделать в отдельном файле и загрузить на github! Наименование функции должно описывать ее функционал
Продумать пограничные значения, делить на 0 нельзя, нужно это учесть
**/

/*Почитать логические операции*/
/*Переделать задачу 3*/

function sum(a, b) {
    return a + b;
}

console.log(sum(1, 2))

const a = 5;
const b = 5;
console.log(a === b);

const c = {a: 5}
const d = c
console.log(c === d);

